In [4]:
import sqlite3
import sqlalchemy
import pandas as pd
import numpy as np
import yfinance as yf
from datetime import date
from components.tickers import *

start_date = date.fromisoformat("2015-01-03")

In [5]:
engine = sqlalchemy.create_engine('sqlite:///database.db')

In [6]:
ticker1 = yf.Tickers(all_tickers)

dataframe1 = ticker1.history(
    start=start_date, interval="1d", rounding=True, auto_adjust=True).Close

[*********************100%***********************]  686 of 686 completed

In [7]:
dataframe1 = dataframe1.reset_index()

In [20]:
dataframe1

,Date,A,AAP,AAPL,ABB,ABM,ABR,ABT,ACGL,ACIW,...,XRAY,XRX,YELP,YEXT,Z,ZBRA,ZG,ZLAB,ZTO,ZWS
0,2015-01-05 00:00:00-05:00,37.18,146.34,23.91,15.35,24.37,3.39,38.44,19.38,19.26,...,48.45,26.00,52.53,NaN,NaN,76.34,30.43,NaN,NaN,26.22
1,2015-01-06 00:00:00-05:00,36.60,146.24,23.91,15.14,24.49,3.39,38.00,19.42,18.95,...,47.85,25.66,52.44,NaN,NaN,75.79,30.23,NaN,NaN,25.78
2,2015-01-07 00:00:00-05:00,37.08,149.38,24.25,15.10,24.89,3.45,38.31,19.54,19.03,...,49.09,25.98,52.21,NaN,NaN,77.72,31.72,NaN,NaN,25.82
3,2015-01-08 00:00:00-05:00,38.19,150.69,25.18,15.30,25.20,3.39,39.10,19.88,19.01,...,50.30,26.70,53.83,NaN,NaN,79.38,32.41,NaN,NaN,26.06
4,2015-01-09 00:00:00-05:00,37.91,149.92,25.21,15.13,25.05,3.37,38.69,19.70,18.68,...,49.57,26.54,56.07,NaN,NaN,80.54,32.03,NaN,NaN,26.04
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2023,2023-01-18 00:00:00-05:00,154.07,146.98,135.21,33.99,45.27,14.17,111.51,63.52,26.38,...,36.92,16.79,28.77,6.44,42.46,296.54,41.37,43.73,28.00,21.42
2024,2023-01-19 00:00:00-05:00,152.87,143.27,135.27,33.47,44.59,14.17,111.80,63.39,28.46,...,36.62,16.54,29.23,6.36,41.81,287.72,40.83,45.69,28.33,20.44
2025,2023-01-20 00:00:00-05:00,155.92,147.49,137.87,33.96,44.93,14.27,112.82,62.46,28.99,...,36.97,17.01,29.71,6.38,43.16,297.03,42.02,45.53,28.41,20.81
2026,2023-01-23 00:00:00-05:00,159.06,148.62,141.11,34.17,44.81,14.40,114.01,63.13,28.80,...,37.41,17.05,29.85,6.69,44.42,317.76,43.19,45.61,28.54,21.35
2027,2023-01-24 00:00:00-05:00,155.69,147.27,142.53,34.22,45.19,14.36,112.53,64.04,27.96,...,35.89,17.28,29.58,6.58,44.62,310.08,43.33,45.54,28.82,21.35

In [8]:
dataframe1['Date'] = pd.DatetimeIndex(dataframe1['Date'])

In [9]:
dataframe1.to_sql("stockData", engine, if_exists='replace', index=False)

2028

In [16]:
pd.read_sql_query("SELECT * FROM stockdata", engine, parse_dates="Date").head(3)

,Date,A,AAP,AAPL,ABB,ABM,ABR,ABT,ACGL,ACIW,...,XRAY,XRX,YELP,YEXT,Z,ZBRA,ZG,ZLAB,ZTO,ZWS
0,2015-01-05,37.18,146.34,23.91,15.35,24.37,3.39,38.44,19.38,19.26,...,48.45,26.00,52.53,NaN,NaN,76.34,30.43,NaN,NaN,26.22
1,2015-01-06,36.60,146.24,23.91,15.14,24.49,3.39,38.00,19.42,18.95,...,47.85,25.66,52.44,NaN,NaN,75.79,30.23,NaN,NaN,25.78
2,2015-01-07,37.08,149.38,24.25,15.10,24.89,3.45,38.31,19.54,19.03,...,49.09,25.98,52.21,NaN,NaN,77.72,31.72,NaN,NaN,25.82

In [11]:
pd.read_sql("SELECT Date, COUNT(*) AS JustCounting FROM stockData WHERE A<35", engine, parse_dates="Date")

        Date  JustCounting
0 2015-08-21            58

In [12]:

# AVG
# COUNT
# DISTINCT
# LOWER
# MAX
# MIN
# UPPER
# WHERE
# LIKE
# ORDER BY
# LIMIT
# GROUP BY
# DESC

# UPDATE table SET column = value WHERE condition
# DELETE FROM table WHERE condition

# Data types: BLOB (Binary large object), INTEGER, NUMERIC (special number based info like dates, times etc...), REAL (foat number), TEXT

# NOT NULL is used to make sure that value was represented (text or number)

# SELECT column FROM table WHERE id IN (SELECT id FROM table WHERE condition = value) . First executes in brackets, then combines information

# SELECT column FROM table WHERE id IN (SELECT short_id FROM shorts WHERE short_id = (SELECT id FROM longs WHERE long = name)) ORDER BY column

# SELECT * FROM shows JOIN genres ON shows.id = genres.show_id WHERE title = 'the office'
# SELECT * FROM people WHERE name LIKE 'Steve C%'  % sign tells to choose anything after C

# CREATE INDEX column_index ON shows (column_name) . Makes searches much faster with seperate column index. B-trees

# variable_name = input("ticker: ")
# db.execute("SELECT * FROM table WHERE ticker = ?", variable_name)  dynamic routing

# race condition - many users do the same requests.

# to make race condition less problamatic there are few solutions: BEGIN TRANSACTION, COMMIT, ROLLBACK.
# db.execute("BEGIN TRANSACTION")
# rows = db.execute("SELECT * FROM data WHERE id = ?", id)
# likes = rows[0]["likes"]
# db.execute("UPDATE posts SET likes = ? WHERE id = ?", likes+1, id)
# db.execute("COMMIT")

#  '-- in SQL means ignore after dashes (comments out left code). Single qoute helps if DB code line is formatted, not used ?.

In [19]:
pd.read_sql("SELECT Date, A FROM stockData GROUP BY A", engine, parse_dates="Date").head()

        Date      A
0 2015-09-28  31.42
1 2015-09-29  31.76
2 2015-08-25  32.25
3 2015-09-30  32.32
4 2015-09-24  32.43

In [18]:
pd.read_sql(schema, engine)

NameError: name 'schema' is not defined